<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Kavenegar API Key
    |--------------------------------------------------------------------------
    | کلید API خود را از پنل کاوه‌نگار بگیرید و در فایل .env قرار دهید
    */
    'api_key' => env('KAVENEGAR_API_KEY', ''),

    /*
    |--------------------------------------------------------------------------
    | Sender Number
    |--------------------------------------------------------------------------
    | شماره خط اختصاصی یا عمومی که پیامک‌ها از آن ارسال می‌شود
    */
    'sender' => env('KAVENEGAR_SENDER', ''),

    /*
    |--------------------------------------------------------------------------
    | Template Name (برای پیامک‌های VerifyLookup)
    |--------------------------------------------------------------------------
    */
    'template' => env('KAVENEGAR_TEMPLATE', 'verifycode'),
];
